<?xml version="1.0" encoding="UTF-8"?>
<net name="action-recognition-0001-decoder" version="10">
	<layers>
		<layer id="0" name="0" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,16,512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="2491177/Output_0/Data_/copy_const292_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,16,512" size="16384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="250" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="22872291_const" type="Const" version="opset1">
			<data element_type="f16" offset="16384" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="4" name="22882292_const" type="Const" version="opset1">
			<data element_type="f16" offset="16386" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="5" name="22892293_const" type="Const" version="opset1">
			<data element_type="f16" offset="16384" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="6" name="22902294_const" type="Const" version="opset1">
			<data element_type="f16" offset="16386" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="7" name="264/3D_Tile_Unsqueeze/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="264/3D_Tile_Unsqueeze_dim6662_const294_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="264/3D_Tile_Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="66646666_const296_const" type="Const" version="opset1">
			<data element_type="i64" offset="16396" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="264" type="Tile" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="264/3D_Tile_Squeeze_dim6669_const298_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="264/3D_Tile_Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="271/Cast_19999_const300_const" type="Const" version="opset1">
			<data element_type="i64" offset="16428" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="271" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="decoder_290/fq_weights_1/Convert_to_float/Cast_04645_const" type="Const" version="opset1">
			<data element_type="u8" offset="16452" shape="8,64,512" size="262144"/>
			<output>
				<port id="1" precision="U8">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="290/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="decoder_290/fq_weights_1/Copy/out_low4179_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="decoder_290/fq_weights_1/Copy/out_high4180_const" type="Const" version="opset1">
			<data element_type="f16" offset="278598" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="17891793_const" type="Const" version="opset1">
			<data element_type="f16" offset="278600" shape="8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="17901794_const" type="Const" version="opset1">
			<data element_type="f16" offset="278616" shape="8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="290/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="290" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="23772381_const" type="Const" version="opset1">
			<data element_type="f16" offset="278632" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="25" name="23782382_const" type="Const" version="opset1">
			<data element_type="f16" offset="278634" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="26" name="23792383_const" type="Const" version="opset1">
			<data element_type="f16" offset="278632" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="27" name="23802384_const" type="Const" version="opset1">
			<data element_type="f16" offset="278634" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="28" name="297/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="297/Cast_19917_const304_const" type="Const" version="opset1">
			<data element_type="i64" offset="278636" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="297" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="273/3D_Tile_Unsqueeze_dim6710_const306_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="273/3D_Tile_Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="67126714_const308_const" type="Const" version="opset1">
			<data element_type="i64" offset="16396" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="273" type="Tile" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="273/3D_Tile_Squeeze_dim6717_const310_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="273/3D_Tile_Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="280/Cast_19961_const312_const" type="Const" version="opset1">
			<data element_type="i64" offset="16428" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="280" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="decoder_298/fq_weights_1/Convert_to_float/Cast_04671_const" type="Const" version="opset1">
			<data element_type="u8" offset="278660" shape="8,64,512" size="262144"/>
			<output>
				<port id="1" precision="U8">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="298/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="decoder_298/fq_weights_1/Copy/out_low4067_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="decoder_298/fq_weights_1/Copy/out_high4068_const" type="Const" version="opset1">
			<data element_type="f16" offset="278598" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="16291633_const" type="Const" version="opset1">
			<data element_type="f16" offset="540804" shape="8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="16301634_const" type="Const" version="opset1">
			<data element_type="f16" offset="540820" shape="8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="298/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="298" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="23972401_const" type="Const" version="opset1">
			<data element_type="f16" offset="540836" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="48" name="23982402_const" type="Const" version="opset1">
			<data element_type="f16" offset="540838" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="49" name="23992403_const" type="Const" version="opset1">
			<data element_type="f16" offset="540836" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="50" name="24002404_const" type="Const" version="opset1">
			<data element_type="f16" offset="540838" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="51" name="305/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="305/Cast_19929_const316_const" type="Const" version="opset1">
			<data element_type="i64" offset="278636" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="305" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="decoder_314/Cast_14637_const" type="Const" version="opset1">
			<data element_type="i64" offset="540840" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="314" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="decoder_317/fq_input_1/Convert_to_float/Cast_04623_const" type="Const" version="opset1">
			<data element_type="u8" offset="540864" shape="1,64,1" size="64"/>
			<output>
				<port id="1" precision="U8">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="317/fq_input_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="decoder_317/fq_input_1/Copy/out_low4059_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="decoder_317/fq_input_1/Copy/out_high4060_const" type="Const" version="opset1">
			<data element_type="f16" offset="278598" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="13691373_const" type="Const" version="opset1">
			<data element_type="f16" offset="540928" shape="1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="13701374_const" type="Const" version="opset1">
			<data element_type="f16" offset="540930" shape="1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="317/fq_input_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="317" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="16471651_const" type="Const" version="opset1">
			<data element_type="f16" offset="540932" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="65" name="16481652_const" type="Const" version="opset1">
			<data element_type="f16" offset="540934" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="66" name="16491653_const" type="Const" version="opset1">
			<data element_type="f16" offset="540932" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="67" name="16501654_const" type="Const" version="opset1">
			<data element_type="f16" offset="540934" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="68" name="315/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="315" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="False"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="329/Cast_19951_const323_const" type="Const" version="opset1">
			<data element_type="i64" offset="540936" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="329" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="330/FlattenONNX_/Reshape/Cast_19987_const325_const" type="Const" version="opset1">
			<data element_type="i64" offset="540952" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="330/FlattenONNX_/Reshape" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="330" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="24072411_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="76" name="24082412_const" type="Const" version="opset1">
			<data element_type="f16" offset="540968" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="77" name="24092413_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="78" name="24102414_const" type="Const" version="opset1">
			<data element_type="f16" offset="540968" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="79" name="336/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="336/Cast_19941_const328_const" type="Const" version="opset1">
			<data element_type="i64" offset="540970" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="336" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="282/3D_Tile_Unsqueeze_dim6614_const330_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="282/3D_Tile_Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="66166618_const332_const" type="Const" version="opset1">
			<data element_type="i64" offset="16396" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="282" type="Tile" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="282/3D_Tile_Squeeze_dim6621_const334_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="282/3D_Tile_Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="289/Cast_19981_const336_const" type="Const" version="opset1">
			<data element_type="i64" offset="16428" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="289" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="decoder_306/fq_weights_1/Convert_to_float/Cast_04643_const" type="Const" version="opset1">
			<data element_type="u8" offset="540994" shape="8,64,512" size="262144"/>
			<output>
				<port id="1" precision="U8">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="306/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="decoder_306/fq_weights_1/Copy/out_low4051_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="decoder_306/fq_weights_1/Copy/out_high4052_const" type="Const" version="opset1">
			<data element_type="f16" offset="278598" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="15491553_const" type="Const" version="opset1">
			<data element_type="f16" offset="803138" shape="8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="15501554_const" type="Const" version="opset1">
			<data element_type="f16" offset="803154" shape="8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="306/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="306" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="24172421_const" type="Const" version="opset1">
			<data element_type="f16" offset="803170" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="99" name="24182422_const" type="Const" version="opset1">
			<data element_type="f16" offset="803172" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="100" name="24192423_const" type="Const" version="opset1">
			<data element_type="f16" offset="803170" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="101" name="24202424_const" type="Const" version="opset1">
			<data element_type="f16" offset="803172" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="102" name="313/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="313/Cast_19945_const340_const" type="Const" version="opset1">
			<data element_type="i64" offset="278636" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="313" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="339" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="False"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="24472451_const" type="Const" version="opset1">
			<data element_type="f16" offset="803174" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="107" name="24482452_const" type="Const" version="opset1">
			<data element_type="f16" offset="803176" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="108" name="24492453_const" type="Const" version="opset1">
			<data element_type="f16" offset="803174" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="109" name="24502454_const" type="Const" version="opset1">
			<data element_type="f16" offset="803176" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="110" name="341/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="341/Cast_110001_const343_const" type="Const" version="opset1">
			<data element_type="i64" offset="803178" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="341" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="decoder_342/Cast_14599_const" type="Const" version="opset1">
			<data element_type="i64" offset="803210" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="342" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="344/Cast_19997_const347_const" type="Const" version="opset1">
			<data element_type="i64" offset="803242" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="344" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="347" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="24572461_const" type="Const" version="opset1">
			<data element_type="f16" offset="803266" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="119" name="24582462_const" type="Const" version="opset1">
			<data element_type="f16" offset="803268" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="120" name="24592463_const" type="Const" version="opset1">
			<data element_type="f16" offset="803266" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="121" name="24602464_const" type="Const" version="opset1">
			<data element_type="f16" offset="803268" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="122" name="348/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="decoder_348/Cast_14619_const" type="Const" version="opset1">
			<data element_type="i64" offset="540840" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="348" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="decoder_349/WithoutBiases/fq_weights_1/Convert_to_float/Cast_04661_const" type="Const" version="opset1">
			<data element_type="u8" offset="803270" shape="1024,512,1" size="524288"/>
			<output>
				<port id="1" precision="U8">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="349/WithoutBiases/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="decoder_349/WithoutBiases/fq_weights_1/Copy/out_low4115_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="decoder_349/WithoutBiases/fq_weights_1/Copy/out_high4116_const" type="Const" version="opset1">
			<data element_type="f16" offset="278598" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="10491053_const" type="Const" version="opset1">
			<data element_type="f16" offset="1327558" shape="1024,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="10501054_const" type="Const" version="opset1">
			<data element_type="f16" offset="1329606" shape="1024,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="349/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="349/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1" output_padding="0" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="349/Dims3513/copy_const354_const" type="Const" version="opset1">
			<data element_type="f16" offset="1331654" shape="1,1024,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="349" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="350" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="15971601_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="137" name="15981602_const" type="Const" version="opset1">
			<data element_type="f16" offset="1333702" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="138" name="15991603_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="139" name="16001604_const" type="Const" version="opset1">
			<data element_type="f16" offset="1333702" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="140" name="351/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="decoder_351/WithoutBiases/fq_weights_1/Convert_to_float/Cast_04603_const" type="Const" version="opset1">
			<data element_type="u8" offset="1333704" shape="512,1024,1" size="524288"/>
			<output>
				<port id="1" precision="U8">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="351/WithoutBiases/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="decoder_351/WithoutBiases/fq_weights_1/Copy/out_low4107_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="decoder_351/WithoutBiases/fq_weights_1/Copy/out_high4108_const" type="Const" version="opset1">
			<data element_type="f16" offset="278598" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="16091613_const" type="Const" version="opset1">
			<data element_type="f16" offset="1857992" shape="512,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="16101614_const" type="Const" version="opset1">
			<data element_type="f16" offset="1859016" shape="512,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="147" name="351/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="351/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1" output_padding="0" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="351/Dims3489/copy_const359_const" type="Const" version="opset1">
			<data element_type="f16" offset="1860040" shape="1,512,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="351" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="24672471_const" type="Const" version="opset1">
			<data element_type="f16" offset="1861064" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="152" name="24682472_const" type="Const" version="opset1">
			<data element_type="f16" offset="1861066" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="153" name="24692473_const" type="Const" version="opset1">
			<data element_type="f16" offset="1861064" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="154" name="24702474_const" type="Const" version="opset1">
			<data element_type="f16" offset="1861066" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="155" name="352/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="156" name="decoder_352/Cast_14635_const" type="Const" version="opset1">
			<data element_type="i64" offset="540840" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="352" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="158" name="355" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
