<?xml version="1.0" encoding="UTF-8"?>
<net name="driver-action-recognition-adas-0002-decoder" version="10">
	<layers>
		<layer id="0" name="0" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,16,512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="3631387/Output_0/Data_/copy_const284_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,16,512" size="16384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="364" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="22972301_const" type="Const" version="opset1">
			<data element_type="f16" offset="16384" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="4" name="22982302_const" type="Const" version="opset1">
			<data element_type="f16" offset="16386" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="5" name="22992303_const" type="Const" version="opset1">
			<data element_type="f16" offset="16384" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="6" name="23002304_const" type="Const" version="opset1">
			<data element_type="f16" offset="16386" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="7" name="378/3D_Tile_Unsqueeze/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="378/3D_Tile_Unsqueeze_dim6642_const286_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="378/3D_Tile_Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="66446646_const288_const" type="Const" version="opset1">
			<data element_type="i64" offset="16396" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="378" type="Tile" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="378/3D_Tile_Squeeze_dim6649_const290_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="378/3D_Tile_Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="385/Cast_19879_const292_const" type="Const" version="opset1">
			<data element_type="i64" offset="16428" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="385" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="decoder_404/fq_weights_1/Convert_to_float/Cast_05139_const" type="Const" version="opset1">
			<data element_type="u8" offset="16452" shape="8,64,512" size="262144"/>
			<output>
				<port id="1" precision="U8">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="404/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="decoder_404/fq_weights_1/Copy/out_low4565_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="decoder_404/fq_weights_1/Copy/out_high4566_const" type="Const" version="opset1">
			<data element_type="f16" offset="278598" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="17991803_const" type="Const" version="opset1">
			<data element_type="f16" offset="278600" shape="8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="18001804_const" type="Const" version="opset1">
			<data element_type="f16" offset="278616" shape="8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="404/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="404" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="23872391_const" type="Const" version="opset1">
			<data element_type="f16" offset="278632" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="25" name="23882392_const" type="Const" version="opset1">
			<data element_type="f16" offset="278634" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="26" name="23892393_const" type="Const" version="opset1">
			<data element_type="f16" offset="278632" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="27" name="23902394_const" type="Const" version="opset1">
			<data element_type="f16" offset="278634" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="28" name="411/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="411/Cast_19911_const296_const" type="Const" version="opset1">
			<data element_type="i64" offset="278636" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="411" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="387/3D_Tile_Unsqueeze_dim6678_const298_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="387/3D_Tile_Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="66806682_const300_const" type="Const" version="opset1">
			<data element_type="i64" offset="16396" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="387" type="Tile" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="387/3D_Tile_Squeeze_dim6685_const302_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="387/3D_Tile_Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="394/Cast_19899_const304_const" type="Const" version="opset1">
			<data element_type="i64" offset="16428" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="394" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="decoder_412/fq_weights_1/Convert_to_float/Cast_05171_const" type="Const" version="opset1">
			<data element_type="u8" offset="278660" shape="8,64,512" size="262144"/>
			<output>
				<port id="1" precision="U8">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="412/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="decoder_412/fq_weights_1/Copy/out_low4533_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="decoder_412/fq_weights_1/Copy/out_high4534_const" type="Const" version="opset1">
			<data element_type="f16" offset="278598" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="11991203_const" type="Const" version="opset1">
			<data element_type="f16" offset="540804" shape="8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="12001204_const" type="Const" version="opset1">
			<data element_type="f16" offset="540820" shape="8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="412/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="412" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="24072411_const" type="Const" version="opset1">
			<data element_type="f16" offset="540836" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="48" name="24082412_const" type="Const" version="opset1">
			<data element_type="f16" offset="540838" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="49" name="24092413_const" type="Const" version="opset1">
			<data element_type="f16" offset="540836" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="50" name="24102414_const" type="Const" version="opset1">
			<data element_type="f16" offset="540838" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="51" name="419/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="419/Cast_19923_const308_const" type="Const" version="opset1">
			<data element_type="i64" offset="278636" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="419" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="decoder_428/Cast_15165_const" type="Const" version="opset1">
			<data element_type="i64" offset="540840" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="428" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="decoder_431/fq_input_1/Convert_to_float/Cast_05197_const" type="Const" version="opset1">
			<data element_type="u8" offset="540864" shape="1,64,1" size="64"/>
			<output>
				<port id="1" precision="U8">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="431/fq_input_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="decoder_431/fq_input_1/Copy/out_low4509_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="decoder_431/fq_input_1/Copy/out_high4510_const" type="Const" version="opset1">
			<data element_type="f16" offset="278598" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="12391243_const" type="Const" version="opset1">
			<data element_type="f16" offset="540928" shape="1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="12401244_const" type="Const" version="opset1">
			<data element_type="f16" offset="540930" shape="1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="431/fq_input_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="431" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="11271131_const" type="Const" version="opset1">
			<data element_type="f16" offset="540932" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="65" name="11281132_const" type="Const" version="opset1">
			<data element_type="f16" offset="540934" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="66" name="11291133_const" type="Const" version="opset1">
			<data element_type="f16" offset="540932" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="67" name="11301134_const" type="Const" version="opset1">
			<data element_type="f16" offset="540934" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="68" name="429/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="429" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="False"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="443/Cast_19945_const315_const" type="Const" version="opset1">
			<data element_type="i64" offset="540936" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="443" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="444/FlattenONNX_/Reshape/Cast_19929_const317_const" type="Const" version="opset1">
			<data element_type="i64" offset="540952" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="444/FlattenONNX_/Reshape" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="444" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="24172421_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="76" name="24182422_const" type="Const" version="opset1">
			<data element_type="f16" offset="540968" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="77" name="24192423_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="78" name="24202424_const" type="Const" version="opset1">
			<data element_type="f16" offset="540968" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="79" name="450/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="450/Cast_19893_const320_const" type="Const" version="opset1">
			<data element_type="i64" offset="540970" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="450" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="396/3D_Tile_Unsqueeze_dim6762_const322_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="396/3D_Tile_Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="67646766_const324_const" type="Const" version="opset1">
			<data element_type="i64" offset="16396" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="396" type="Tile" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="396/3D_Tile_Squeeze_dim6769_const326_const" type="Const" version="opset1">
			<data element_type="i64" offset="16388" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="396/3D_Tile_Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="403/Cast_19951_const328_const" type="Const" version="opset1">
			<data element_type="i64" offset="16428" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="403" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="decoder_420/fq_weights_1/Convert_to_float/Cast_05201_const" type="Const" version="opset1">
			<data element_type="u8" offset="540994" shape="8,64,512" size="262144"/>
			<output>
				<port id="1" precision="U8">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="420/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="decoder_420/fq_weights_1/Copy/out_low4613_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="decoder_420/fq_weights_1/Copy/out_high4614_const" type="Const" version="opset1">
			<data element_type="f16" offset="278598" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="17791783_const" type="Const" version="opset1">
			<data element_type="f16" offset="803138" shape="8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="17801784_const" type="Const" version="opset1">
			<data element_type="f16" offset="803154" shape="8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="420/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="420" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="24272431_const" type="Const" version="opset1">
			<data element_type="f16" offset="803170" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="99" name="24282432_const" type="Const" version="opset1">
			<data element_type="f16" offset="803172" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="100" name="24292433_const" type="Const" version="opset1">
			<data element_type="f16" offset="803170" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="101" name="24302434_const" type="Const" version="opset1">
			<data element_type="f16" offset="803172" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="102" name="427/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="427/Cast_19921_const332_const" type="Const" version="opset1">
			<data element_type="i64" offset="278636" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="427" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="453" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="False"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="454/VariadicSplit_input_port_1/value/Output_0/Data__const335_const" type="Const" version="opset1">
			<data element_type="i64" offset="803174" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="107" name="454/VariadicSplit_input_port_2/value/Output_0/Data__const336_const" type="Const" version="opset1">
			<data element_type="i64" offset="803182" shape="8" size="64"/>
			<output>
				<port id="1" precision="I64">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="454/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="6" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="7" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="8" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="9" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="10" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="24372441_const" type="Const" version="opset1">
			<data element_type="f16" offset="803246" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="110" name="24382442_const" type="Const" version="opset1">
			<data element_type="f16" offset="803248" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="111" name="24392443_const" type="Const" version="opset1">
			<data element_type="f16" offset="803246" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="112" name="24402444_const" type="Const" version="opset1">
			<data element_type="f16" offset="803248" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="113" name="462/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="24472451_const" type="Const" version="opset1">
			<data element_type="f16" offset="803250" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="115" name="24482452_const" type="Const" version="opset1">
			<data element_type="f16" offset="803252" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="116" name="24492453_const" type="Const" version="opset1">
			<data element_type="f16" offset="803250" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="117" name="24502454_const" type="Const" version="opset1">
			<data element_type="f16" offset="803252" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="118" name="462/fq_input_1" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="24572461_const" type="Const" version="opset1">
			<data element_type="f16" offset="803254" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="120" name="24582462_const" type="Const" version="opset1">
			<data element_type="f16" offset="803256" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="121" name="24592463_const" type="Const" version="opset1">
			<data element_type="f16" offset="803254" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="122" name="24602464_const" type="Const" version="opset1">
			<data element_type="f16" offset="803256" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="123" name="462/fq_input_2" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="24672471_const" type="Const" version="opset1">
			<data element_type="f16" offset="803258" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="125" name="24682472_const" type="Const" version="opset1">
			<data element_type="f16" offset="803260" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="126" name="24692473_const" type="Const" version="opset1">
			<data element_type="f16" offset="803258" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="127" name="24702474_const" type="Const" version="opset1">
			<data element_type="f16" offset="803260" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="128" name="462/fq_input_3" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="24772481_const" type="Const" version="opset1">
			<data element_type="f16" offset="803262" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="130" name="24782482_const" type="Const" version="opset1">
			<data element_type="f16" offset="803264" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="131" name="24792483_const" type="Const" version="opset1">
			<data element_type="f16" offset="803262" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="132" name="24802484_const" type="Const" version="opset1">
			<data element_type="f16" offset="803264" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="133" name="462/fq_input_4" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="24872491_const" type="Const" version="opset1">
			<data element_type="f16" offset="803266" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="135" name="24882492_const" type="Const" version="opset1">
			<data element_type="f16" offset="803268" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="136" name="24892493_const" type="Const" version="opset1">
			<data element_type="f16" offset="803266" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="137" name="24902494_const" type="Const" version="opset1">
			<data element_type="f16" offset="803268" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="138" name="462/fq_input_5" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="24972501_const" type="Const" version="opset1">
			<data element_type="f16" offset="803270" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="140" name="24982502_const" type="Const" version="opset1">
			<data element_type="f16" offset="803272" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="141" name="24992503_const" type="Const" version="opset1">
			<data element_type="f16" offset="803270" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="142" name="25002504_const" type="Const" version="opset1">
			<data element_type="f16" offset="803272" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="143" name="462/fq_input_6" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="25072511_const" type="Const" version="opset1">
			<data element_type="f16" offset="803274" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="145" name="25082512_const" type="Const" version="opset1">
			<data element_type="f16" offset="803276" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="146" name="25092513_const" type="Const" version="opset1">
			<data element_type="f16" offset="803274" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="147" name="25102514_const" type="Const" version="opset1">
			<data element_type="f16" offset="803276" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="148" name="462/fq_input_7" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="462" type="Concat" version="opset1">
			<data axis="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="5">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="6">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="7">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="8" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="465" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="25172521_const" type="Const" version="opset1">
			<data element_type="f16" offset="803278" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="152" name="25182522_const" type="Const" version="opset1">
			<data element_type="f16" offset="803280" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="153" name="25192523_const" type="Const" version="opset1">
			<data element_type="f16" offset="803278" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="154" name="25202524_const" type="Const" version="opset1">
			<data element_type="f16" offset="803280" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="155" name="466/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="156" name="decoder_466/Cast_15193_const" type="Const" version="opset1">
			<data element_type="i64" offset="540840" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="466" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="158" name="decoder_467/WithoutBiases/fq_weights_1/Convert_to_float/Cast_05147_const" type="Const" version="opset1">
			<data element_type="u8" offset="803282" shape="1024,512,1" size="524288"/>
			<output>
				<port id="1" precision="U8">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="159" name="467/WithoutBiases/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="160" name="decoder_467/WithoutBiases/fq_weights_1/Copy/out_low4469_const" type="Const" version="opset1">
			<data element_type="f16" offset="278596" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="161" name="decoder_467/WithoutBiases/fq_weights_1/Copy/out_high4470_const" type="Const" version="opset1">
			<data element_type="f16" offset="278598" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="162" name="10491053_const" type="Const" version="opset1">
			<data element_type="f16" offset="1327570" shape="1024,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="163" name="10501054_const" type="Const" version="opset1">
			<data element_type="f16" offset="1329618" shape="1024,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1024</dim>
